Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/trng.h
// Description : Reflects rng_busy status.
#define TRNG_TRNG_BUSY_TRNG_BUSY_RESET  _u(0x0)
#define TRNG_TRNG_BUSY_TRNG_BUSY_BITS   _u(0x00000001)
#define TRNG_TRNG_BUSY_TRNG_BUSY_MSB    _u(0)
#define TRNG_TRNG_BUSY_TRNG_BUSY_LSB    _u(0)
#define TRNG_TRNG_BUSY_TRNG_BUSY_ACCESS "RO"
// =============================================================================
// Register    : TRNG_RST_BITS_COUNTER
// Description : Reset the counter of collected bits in the RNG.
#define TRNG_RST_BITS_COUNTER_OFFSET _u(0x000001bc)
#define TRNG_RST_BITS_COUNTER_BITS   _u(0xffffffff)
#define TRNG_RST_BITS_COUNTER_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : TRNG_RST_BITS_COUNTER_RESERVED
// Description : RESERVED
#define TRNG_RST_BITS_COUNTER_RESERVED_RESET  _u(0x00000000)
#define TRNG_RST_BITS_COUNTER_RESERVED_BITS   _u(0xfffffffe)
#define TRNG_RST_BITS_COUNTER_RESERVED_MSB    _u(31)
#define TRNG_RST_BITS_COUNTER_RESERVED_LSB    _u(1)
#define TRNG_RST_BITS_COUNTER_RESERVED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER
// Description : Writing any value to this address will reset the bits counter
//               and RNG valid registers. RND_SORCE_ENABLE register must be
//               unset in order for the reset to take place.
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_RESET  _u(0x0)
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_BITS   _u(0x00000001)
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_MSB    _u(0)
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_LSB    _u(0)
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_ACCESS "RW"
// =============================================================================
// Register    : TRNG_RNG_VERSION
// Description : Displays the version settings of the TRNG.
#define TRNG_RNG_VERSION_OFFSET _u(0x000001c0)
#define TRNG_RNG_VERSION_BITS   _u(0xffffffff)
#define TRNG_RNG_VERSION_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_RESERVED
// Description : RESERVED
#define TRNG_RNG_VERSION_RESERVED_RESET  _u(0x000000)
#define TRNG_RNG_VERSION_RESERVED_BITS   _u(0xffffff00)
#define TRNG_RNG_VERSION_RESERVED_MSB    _u(31)
#define TRNG_RNG_VERSION_RESERVED_LSB    _u(8)
#define TRNG_RNG_VERSION_RESERVED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_RNG_USE_5_SBOXES
// Description : * 1'b1 - 5 SBOX AES. *1'b0 - 20 SBOX AES
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_RESET  _u(0x0)
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_BITS   _u(0x00000080)
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_MSB    _u(7)
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_LSB    _u(7)
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_RESEEDING_EXISTS
// Description : * 1'b1 - Exists. *1'b0 - Does not exist
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_RESET  _u(0x0)
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_BITS   _u(0x00000040)
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_MSB    _u(6)
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_LSB    _u(6)
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_KAT_EXISTS
// Description : * 1'b1 - Exists. *1'b0 - Does not exist
#define TRNG_RNG_VERSION_KAT_EXISTS_RESET  _u(0x0)
#define TRNG_RNG_VERSION_KAT_EXISTS_BITS   _u(0x00000020)
#define TRNG_RNG_VERSION_KAT_EXISTS_MSB    _u(5)
#define TRNG_RNG_VERSION_KAT_EXISTS_LSB    _u(5)
#define TRNG_RNG_VERSION_KAT_EXISTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_PRNG_EXISTS
// Description : * 1'b1 - Exists. *1'b0 - Does not exist
#define TRNG_RNG_VERSION_PRNG_EXISTS_RESET  _u(0x0)
#define TRNG_RNG_VERSION_PRNG_EXISTS_BITS   _u(0x00000010)
#define TRNG_RNG_VERSION_PRNG_EXISTS_MSB    _u(4)
#define TRNG_RNG_VERSION_PRNG_EXISTS_LSB    _u(4)
#define TRNG_RNG_VERSION_PRNG_EXISTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN
// Description : * 1'b1 - Exists. *1'b0 - Does not exist
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_RESET  _u(0x0)
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_BITS   _u(0x00000008)
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_MSB    _u(3)
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_LSB    _u(3)
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_AUTOCORR_EXISTS
// Description : * 1'b1 - Exists. *1'b0 - Does not exist
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_RESET  _u(0x0)
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_BITS   _u(0x00000004)
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_MSB    _u(2)
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_LSB    _u(2)
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_CRNGT_EXISTS
// Description : * 1'b1 - Exists. *1'b0 - Does not exist
#define TRNG_RNG_VERSION_CRNGT_EXISTS_RESET  _u(0x0)
#define TRNG_RNG_VERSION_CRNGT_EXISTS_BITS   _u(0x00000002)
#define TRNG_RNG_VERSION_CRNGT_EXISTS_MSB    _u(1)
#define TRNG_RNG_VERSION_CRNGT_EXISTS_LSB    _u(1)
#define TRNG_RNG_VERSION_CRNGT_EXISTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_VERSION_EHR_WIDTH_192
// Description : * 1'b1 - 192-bit EHR. *1'b0 - 128-bit EHR
#define TRNG_RNG_VERSION_EHR_WIDTH_192_RESET  _u(0x0)
#define TRNG_RNG_VERSION_EHR_WIDTH_192_BITS   _u(0x00000001)
#define TRNG_RNG_VERSION_EHR_WIDTH_192_MSB    _u(0)
#define TRNG_RNG_VERSION_EHR_WIDTH_192_LSB    _u(0)
#define TRNG_RNG_VERSION_EHR_WIDTH_192_ACCESS "RO"
// =============================================================================
// Register    : TRNG_RNG_BIST_CNTR_0
// Description : Collected BIST results.
#define TRNG_RNG_BIST_CNTR_0_OFFSET _u(0x000001e0)
#define TRNG_RNG_BIST_CNTR_0_BITS   _u(0xffffffff)
#define TRNG_RNG_BIST_CNTR_0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_BIST_CNTR_0_RESERVED
// Description : RESERVED
#define TRNG_RNG_BIST_CNTR_0_RESERVED_RESET  _u(0x000)
#define TRNG_RNG_BIST_CNTR_0_RESERVED_BITS   _u(0xffc00000)
#define TRNG_RNG_BIST_CNTR_0_RESERVED_MSB    _u(31)
#define TRNG_RNG_BIST_CNTR_0_RESERVED_LSB    _u(22)
#define TRNG_RNG_BIST_CNTR_0_RESERVED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL
// Description : Reflects the results of RNG BIST counter.
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_RESET  _u(0x000000)
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_BITS   _u(0x003fffff)
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_MSB    _u(21)
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_LSB    _u(0)
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_ACCESS "RO"
// =============================================================================
// Register    : TRNG_RNG_BIST_CNTR_1
// Description : Collected BIST results.
#define TRNG_RNG_BIST_CNTR_1_OFFSET _u(0x000001e4)
#define TRNG_RNG_BIST_CNTR_1_BITS   _u(0xffffffff)
#define TRNG_RNG_BIST_CNTR_1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_BIST_CNTR_1_RESERVED
// Description : RESERVED
#define TRNG_RNG_BIST_CNTR_1_RESERVED_RESET  _u(0x000)
#define TRNG_RNG_BIST_CNTR_1_RESERVED_BITS   _u(0xffc00000)
#define TRNG_RNG_BIST_CNTR_1_RESERVED_MSB    _u(31)
#define TRNG_RNG_BIST_CNTR_1_RESERVED_LSB    _u(22)
#define TRNG_RNG_BIST_CNTR_1_RESERVED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL
// Description : Reflects the results of RNG BIST counter.
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_RESET  _u(0x000000)
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_BITS   _u(0x003fffff)
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_MSB    _u(21)
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_LSB    _u(0)
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_ACCESS "RO"
// =============================================================================
// Register    : TRNG_RNG_BIST_CNTR_2
// Description : Collected BIST results.
#define TRNG_RNG_BIST_CNTR_2_OFFSET _u(0x000001e8)
#define TRNG_RNG_BIST_CNTR_2_BITS   _u(0xffffffff)
#define TRNG_RNG_BIST_CNTR_2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_BIST_CNTR_2_RESERVED
// Description : RESERVED
#define TRNG_RNG_BIST_CNTR_2_RESERVED_RESET  _u(0x000)
#define TRNG_RNG_BIST_CNTR_2_RESERVED_BITS   _u(0xffc00000)
#define TRNG_RNG_BIST_CNTR_2_RESERVED_MSB    _u(31)
#define TRNG_RNG_BIST_CNTR_2_RESERVED_LSB    _u(22)
#define TRNG_RNG_BIST_CNTR_2_RESERVED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL
// Description : Reflects the results of RNG BIST counter.
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_RESET  _u(0x000000)
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_BITS   _u(0x003fffff)
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_MSB    _u(21)
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_LSB    _u(0)
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_TRNG_H

